---
kind: property
id: P:Autodesk.Revit.DB.ClassificationEntry.CategoryId
source: html/0df469ce-96b5-5f05-3a04-b0a4f191c131.htm
---
# Autodesk.Revit.DB.ClassificationEntry.CategoryId Property

The id of the category associated with this entry.

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```